essay/maven.org
* maven
#+OPTIONS: H:5
  
** FAQ
参考资源
   - http://maven.apache.org/
   - http://www.ibm.com/developerworks/cn/education/java/j-mavenv2/

** maven能够用来做什么
  - 理解项目通常是如何构建的。
  - 利用其内嵌的项目知识简化和便利项目构建。
  - 利用其内嵌的项目知识来帮助用户理解复杂的项目结构和构建过程中潜在的变数。
  - 设计并实现一个经证实的依赖项管理系统，该系统顺应了当今全球化和相互联系的项目团队的需求。
  - 利用其内部知识，针对简单项目提供简单的用户体验。
  - 对于高级用户来说相当灵活；针对特别的应用场景，可以覆盖其内嵌模型，也可以通过配置、部署元数据或创建自定义插件对其内嵌模型进行改写。
  - 全面扩展现有行为之外的场景细节。
  - 捕获新出现的最佳实践和各个用户社区间的经确认的共同性，并将它们纳入到 Maven 的内嵌项目知识中，从而不断地得到改进。

** maven模型
maven模型分为几个部分：
   - 项目对象模型（POM）： POM 是 Maven 2 中的里程碑式的模型。该模型的一部分已经构建到 Maven 引擎（被亲切地称为反应堆 ）中，其余部分则通过一个名叫 pom.xml 的基于 XML 的元数据文件来声明。
   - 依赖项管理模型： Maven 对如何管理项目的依赖项很在行。依赖项管理是一片灰色地带，典型的构建-管理工具和系统都未明确涉及。Maven 2 构建了 Maven 依赖项管理模型，该模型能够适应大多数需求。这个模型被证明是有效而高产的模型，目前，主要的开源项目都部署了该模型。
   - 构建生命周期和阶段：和 POM 相关的概念是构建生命周期 和阶段。这是 Maven 2 的内嵌概念模型和现实物理世界之间的接口。使用 Maven 时，工作主要是通过插件来执行的。在构建周期中，Maven 2 通过遵循一系列定义好的阶段，将这些插件协调起来。
   - 插件：插件中每个认为被称为mojo（构建任务）。Maven 引擎在执行构建生命周期中相应的阶段时，执行插件中的 mojo（构建任务）。插件的 mojo 和生命周期中的阶段间的关联叫做绑定 。插件开发人员能够灵活地将一个或多个生命周期阶段和一个插件关联起来。 

** maven生命周期
| 生命周期     | 阶段描述                                                                                                                           |
|--------------+------------------------------------------------------------------------------------------------------------------------------------|
| 验证         | 确保当前配置和 POM 的内容是有效的。这包含对 pom.xml 文件树的验证。                                                                 |
| 初始化       | 在执行构建生命周期的主任务之前可以进行初始化。                                                                                     |
| 生成源码代码 | 生成器可以开始生成在以后阶段中处理或编译的源代码。                                                                                 |
| 处理源码     | 提供解析、修改和转换源码。常规源码和生成的源码都可以在这里处理。                                                                   |
| 生成资源     | 可以生成非源码资源。通常包括元数据文件和配置文件。                                                                                 |
| 处理资源     | 处理非源码资源。修改、转换和重定位资源都能在这阶段发生。                                                                           |
| 编译         | 编译源码。编译过的类被放到目标目录树中。                                                                                           |
| 处理类处理   | 类文件转换和增强步骤。字节码交织器和常用工具常在这一阶段操作。                                                                     |
| 生成测试源码 | mojo 可以生成要操作的单元测试代码。                                                                                                |
| 处理测试源码 | 在编译前对测试源码执行任何必要的处理。在这一阶段，可以修改、转换或复制源代码。                                                     |
| 生成测试资源 | 允许生成与测试相关的（非源码）资源。                                                                                               |
| 处理测试资源 | 可以处理、转换和重新定位与测试相关的资源。                                                                                         |
| 测试编译     | 编译单元测试的源码。                                                                                                               |
| 测试         | 运行编译过的单元测试并累计结果。                                                                                                   |
| 打包         | 将可执行的二进制文件打包到一个分布式归档文件中，如 JAR 或 WAR。                                                                    |
| 前集成测试   | 准备集成测试。这种情况下的集成测试是指在一个受到一定控制的模拟的真实部署环境中测试代码。这一步能将归档文件部署到一个服务器上执行。 |
| 集成测试     | 执行真正的集成测试。                                                                                                               |
| 后集成测试   | 解除集成测试准备。这一步涉及测试环境重置或重新初始化。                                                                             |
| 检验检验     | 可部署归档的有效性和完整性。过了这个阶段，将安装该归档。                                                                           |
| 安装         | 将该归档添加到本地 Maven 目录。这一步让其他可能依赖该归档的模块可以使用它。                                                        |
| 部署         | 将该归档添加到远程 Maven 目录。这一步让这个工件能为更多的人所用。                                                                  |
Maven 从开源社区中汲取了十多年的项目构建管理经验。很难找到一个构建周期不符合上表中的生命周期阶段的软件项目。启动 Maven 2 引擎后，它会按顺序经历表中的各阶段，执行可能与该阶段绑定的 mojo。每个 mojo 则可以使用 Maven 2 丰富的 POM 支持、依赖项管理，也可以访问执行这一专门任务时的构建状态信息。调用 Maven 2 引擎时，可以将一个生命周期阶段指定为命令行参数。该引擎一直执行到指定的阶段（包括该指定的阶段）。包含的阶段中所有的 mojo 都会被触发。

但是在这里有另外一个版本，大家可以参考一下 http://maven.apache.org/guides/getting-started/maven-in-five-minutes.html 
   - validate: validate the project is correct and all necessary information is available
   - compile: compile the source code of the project
   - test: test the compiled source code using a suitable unit testing framework. These tests should not require the code be packaged or deployed
   - package: take the compiled code and package it in its distributable format, such as a JAR.
   - integration-test: process and deploy the package if necessary into an environment where integration tests can be run
   - verify: run any checks to verify the package is valid and meets quality criteria
   - install: install the package into the local repository, for use as a dependency in other projects locally
   - deploy: done in an integration or release environment, copies the final package to the remote repository for sharing with other developers and projects.
There are two other Maven lifecycles of note beyond the default list above. They are
   - clean: cleans up artifacts created by prior builds
   - site: generates site documentation for this project

** maven仓库
Maven 2 仓库存储 Maven 在一个项目的依赖项解析中使用过的工件集。在本地磁盘上访问本地仓库，通过网络访问远程仓库。工件通常被打包成包含二进制库或可执行库的 JAR 文件。这被认为是工件的一个类型。但在实践中，工件也可以是 WAR、EAR 或其他代码捆绑类型。Maven 2 利用操作系统的目录结构对存储在仓库中的工件集进行快速索引。这个仓库索引系统依赖于这种能力来通过工件的坐标惟一标识工件。Maven 坐标是一组可以惟一标识工件的三元组值。坐标包含了下列三条信息：
   - (groupId)组 ID：代表制造该工件的实体或组织。例如，com.ibm.devworks 就是一个组 ID。
   - (artifactId)工件 ID：实际的工件的名称。例如，主体类名为 OpsImp 的项目也许会用 OpsImp 作为其工件 ID。
   - (version)版本：该工件的版本号。支持的格式为 mmm.nnn.bbb-qqqqqqq-dd ，其中， mmm 是主版本号， nnn 是次版本号， bbb 代表其 bug 修复水平。 qqqqq （限定词）或 dd （构建号）也能添加到版本号中，这两项是可选项。
下面是JUnit依赖项的Maven坐标：
#+BEGIN_SRC XML
<dependencies>
   <dependency>
      <groupId>junit</groupId>
      <artifactId>junit</artifactId>
      <version>3.8.1</version>
   </dependency>
</dependencies>
#+END_SRC
NOTE(dirlt):另外两个并不常用的坐标指标是：TODO(dirlt):add some examples.
   - packaging. jar, pom etc.
   - classifier. javadoc, jdk15 etc.

