www/maven.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>maven</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="maven"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-08-23 23:12:00 CST"/>
<meta name="author" content="dirtysalt"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">maven</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 maven</a>
<ul>
<li><a href="#sec-1-1">1.1 FAQ</a></li>
<li><a href="#sec-1-2">1.2 maven能够用来做什么</a></li>
<li><a href="#sec-1-3">1.3 maven模型</a></li>
<li><a href="#sec-1-4">1.4 maven生命周期</a></li>
<li><a href="#sec-1-5">1.5 maven仓库</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 本地仓库</a></li>
<li><a href="#sec-1-5-2">1.5.2 远程仓库</a></li>
<li><a href="#sec-1-5-3">1.5.3 分发构件至远程仓库</a></li>
<li><a href="#sec-1-5-4">1.5.4 远程仓库搭建</a></li>
</ul>
</li>
<li><a href="#sec-1-6">1.6 maven常用操作</a>
<ul>
<li><a href="#sec-1-6-1">1.6.1 创建项目(archetype)</a></li>
<li><a href="#sec-1-6-2">1.6.2 编译测试项目(maven-compiler-plugin)</a></li>
<li><a href="#sec-1-6-3">1.6.3 配置多模块项目(multiple modules project)</a></li>
<li><a href="#sec-1-6-4">1.6.4 部署项目(deploy)</a></li>
</ul>
</li>
<li><a href="#sec-1-7">1.7 maven常用插件</a>
<ul>
<li><a href="#sec-1-7-1">1.7.1 maven-compiler-plugin</a></li>
<li><a href="#sec-1-7-2">1.7.2 maven-jar-plugin</a></li>
</ul>
</li>
<li><a href="#sec-1-8">1.8 .m2/settings.xml</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> maven</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> FAQ</h3>
<div class="outline-text-3" id="text-1-1">

<p>参考资源
</p><ul>
<li><a href="http://maven.apache.org/">http://maven.apache.org/</a>
</li>
<li><a href="http://www.ibm.com/developerworks/cn/education/java/j-mavenv2/">http://www.ibm.com/developerworks/cn/education/java/j-mavenv2/</a>
</li>
</ul>


</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> maven能够用来做什么</h3>
<div class="outline-text-3" id="text-1-2">

<ul>
<li>理解项目通常是如何构建的。
</li>
<li>利用其内嵌的项目知识简化和便利项目构建。
</li>
<li>利用其内嵌的项目知识来帮助用户理解复杂的项目结构和构建过程中潜在的变数。
</li>
<li>设计并实现一个经证实的依赖项管理系统，该系统顺应了当今全球化和相互联系的项目团队的需求。
</li>
<li>利用其内部知识，针对简单项目提供简单的用户体验。
</li>
<li>对于高级用户来说相当灵活；针对特别的应用场景，可以覆盖其内嵌模型，也可以通过配置、部署元数据或创建自定义插件对其内嵌模型进行改写。
</li>
<li>全面扩展现有行为之外的场景细节。
</li>
<li>捕获新出现的最佳实践和各个用户社区间的经确认的共同性，并将它们纳入到 Maven 的内嵌项目知识中，从而不断地得到改进。
</li>
</ul>


</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> maven模型</h3>
<div class="outline-text-3" id="text-1-3">

<p>maven模型分为几个部分：
</p><ul>
<li>项目对象模型（POM）： POM 是 Maven 2 中的里程碑式的模型。该模型的一部分已经构建到 Maven 引擎（被亲切地称为反应堆 ）中，其余部分则通过一个名叫 pom.xml 的基于 XML 的元数据文件来声明。
</li>
<li>依赖项管理模型： Maven 对如何管理项目的依赖项很在行。依赖项管理是一片灰色地带，典型的构建-管理工具和系统都未明确涉及。Maven 2 构建了 Maven 依赖项管理模型，该模型能够适应大多数需求。这个模型被证明是有效而高产的模型，目前，主要的开源项目都部署了该模型。
</li>
<li>构建生命周期和阶段：和 POM 相关的概念是构建生命周期 和阶段。这是 Maven 2 的内嵌概念模型和现实物理世界之间的接口。使用 Maven 时，工作主要是通过插件来执行的。在构建周期中，Maven 2 通过遵循一系列定义好的阶段，将这些插件协调起来。
</li>
<li>插件：插件中每个认为被称为mojo（构建任务）。Maven 引擎在执行构建生命周期中相应的阶段时，执行插件中的 mojo（构建任务）。插件的 mojo 和生命周期中的阶段间的关联叫做绑定 。插件开发人员能够灵活地将一个或多个生命周期阶段和一个插件关联起来。 
</li>
</ul>


</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> maven生命周期</h3>
<div class="outline-text-3" id="text-1-4">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">生命周期</th><th scope="col" class="left">阶段描述</th></tr>
</thead>
<tbody>
<tr><td class="left">验证</td><td class="left">确保当前配置和 POM 的内容是有效的。这包含对 pom.xml 文件树的验证。</td></tr>
<tr><td class="left">初始化</td><td class="left">在执行构建生命周期的主任务之前可以进行初始化。</td></tr>
<tr><td class="left">生成源码代码</td><td class="left">生成器可以开始生成在以后阶段中处理或编译的源代码。</td></tr>
<tr><td class="left">处理源码</td><td class="left">提供解析、修改和转换源码。常规源码和生成的源码都可以在这里处理。</td></tr>
<tr><td class="left">生成资源</td><td class="left">可以生成非源码资源。通常包括元数据文件和配置文件。</td></tr>
<tr><td class="left">处理资源</td><td class="left">处理非源码资源。修改、转换和重定位资源都能在这阶段发生。</td></tr>
<tr><td class="left">编译</td><td class="left">编译源码。编译过的类被放到目标目录树中。</td></tr>
<tr><td class="left">处理类处理</td><td class="left">类文件转换和增强步骤。字节码交织器和常用工具常在这一阶段操作。</td></tr>
<tr><td class="left">生成测试源码</td><td class="left">mojo 可以生成要操作的单元测试代码。</td></tr>
<tr><td class="left">处理测试源码</td><td class="left">在编译前对测试源码执行任何必要的处理。在这一阶段，可以修改、转换或复制源代码。</td></tr>
<tr><td class="left">生成测试资源</td><td class="left">允许生成与测试相关的（非源码）资源。</td></tr>
<tr><td class="left">处理测试资源</td><td class="left">可以处理、转换和重新定位与测试相关的资源。</td></tr>
<tr><td class="left">测试编译</td><td class="left">编译单元测试的源码。</td></tr>
<tr><td class="left">测试</td><td class="left">运行编译过的单元测试并累计结果。</td></tr>
<tr><td class="left">打包</td><td class="left">将可执行的二进制文件打包到一个分布式归档文件中，如 JAR 或 WAR。</td></tr>
<tr><td class="left">前集成测试</td><td class="left">准备集成测试。这种情况下的集成测试是指在一个受到一定控制的模拟的真实部署环境中测试代码。这一步能将归档文件部署到一个服务器上执行。</td></tr>
<tr><td class="left">集成测试</td><td class="left">执行真正的集成测试。</td></tr>
<tr><td class="left">后集成测试</td><td class="left">解除集成测试准备。这一步涉及测试环境重置或重新初始化。</td></tr>
<tr><td class="left">检验检验</td><td class="left">可部署归档的有效性和完整性。过了这个阶段，将安装该归档。</td></tr>
<tr><td class="left">安装</td><td class="left">将该归档添加到本地 Maven 目录。这一步让其他可能依赖该归档的模块可以使用它。</td></tr>
<tr><td class="left">部署</td><td class="left">将该归档添加到远程 Maven 目录。这一步让这个工件能为更多的人所用。</td></tr>
</tbody>
</table>

Maven 从开源社区中汲取了十多年的项目构建管理经验。很难找到一个构建周期不符合上表中的生命周期阶段的软件项目。启动 Maven 2 引擎后，它会按顺序经历表中的各阶段，执行可能与该阶段绑定的 mojo。每个 mojo 则可以使用 Maven 2 丰富的 POM 支持、依赖项管理，也可以访问执行这一专门任务时的构建状态信息。调用 Maven 2 引擎时，可以将一个生命周期阶段指定为命令行参数。该引擎一直执行到指定的阶段（包括该指定的阶段）。包含的阶段中所有的 mojo 都会被触发。

<p>
但是在这里有另外一个版本，大家可以参考一下 <a href="http://maven.apache.org/guides/getting-started/maven-in-five-minutes.html">http://maven.apache.org/guides/getting-started/maven-in-five-minutes.html</a> 
</p><ul>
<li>validate: validate the project is correct and all necessary information is available
</li>
<li>compile: compile the source code of the project
</li>
<li>test: test the compiled source code using a suitable unit testing framework. These tests should not require the code be packaged or deployed
</li>
<li>package: take the compiled code and package it in its distributable format, such as a JAR.
</li>
<li>integration-test: process and deploy the package if necessary into an environment where integration tests can be run
</li>
<li>verify: run any checks to verify the package is valid and meets quality criteria
</li>
<li>install: install the package into the local repository, for use as a dependency in other projects locally
</li>
<li>deploy: done in an integration or release environment, copies the final package to the remote repository for sharing with other developers and projects.
</li>
</ul>

<p>There are two other Maven lifecycles of note beyond the default list above. They are
</p><ul>
<li>clean: cleans up artifacts created by prior builds
</li>
<li>site: generates site documentation for this project
</li>
</ul>


</div>

</div>

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> maven仓库</h3>
<div class="outline-text-3" id="text-1-5">

<p>Maven 2 仓库存储 Maven 在一个项目的依赖项解析中使用过的工件集。在本地磁盘上访问本地仓库，通过网络访问远程仓库。工件通常被打包成包含二进制库或可执行库的 JAR 文件。这被认为是工件的一个类型。但在实践中，工件也可以是 WAR、EAR 或其他代码捆绑类型。Maven 2 利用操作系统的目录结构对存储在仓库中的工件集进行快速索引。这个仓库索引系统依赖于这种能力来通过工件的坐标惟一标识工件。Maven 坐标是一组可以惟一标识工件的三元组值。坐标包含了下列三条信息：
</p><ul>
<li>(groupId)组 ID：代表制造该工件的实体或组织。例如，com.ibm.devworks 就是一个组 ID。
</li>
<li>(artifactId)工件 ID：实际的工件的名称。例如，主体类名为 OpsImp 的项目也许会用 OpsImp 作为其工件 ID。
</li>
<li>(version)版本：该工件的版本号。支持的格式为 mmm.nnn.bbb-qqqqqqq-dd ，其中， mmm 是主版本号， nnn 是次版本号， bbb 代表其 bug 修复水平。 qqqqq （限定词）或 dd （构建号）也能添加到版本号中，这两项是可选项。
</li>
</ul>

<p>下面是JUnit依赖项的Maven坐标：
</p>


<pre class="src src-XML">&lt;dependencies&gt;
   &lt;dependency&gt;
      &lt;groupId&gt;junit&lt;/groupId&gt;
      &lt;artifactId&gt;junit&lt;/artifactId&gt;
      &lt;version&gt;3.8.1&lt;/version&gt;
   &lt;/dependency&gt;
&lt;/dependencies&gt;
</pre>

<p>
NOTE(dirlt):另外两个并不常用的坐标指标是：TODO(dirlt):add some examples.
</p><ul>
<li>packaging. jar, pom etc.
</li>
<li>classifier. javadoc, jdk15 etc.
</li>
</ul>



</div>
