essay/maven.org
*** 本地仓库
maven默认设置~/.m2/repository为本地仓库。将项目所需要的依赖全部都缓存下来，这样不用每次都重新下载依赖。
#+BEGIN_EXAMPLE
dirlt@dirlt-virtual-machine:~/.m2/repository$ ls -l
total 68
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 antlr
drwxrwxr-x 8 dirlt dirlt 4096  6月 24 22:36 asm
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 classworlds
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 com
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-cli
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-collections
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-io
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-lang
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 dom4j
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 jdom
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 jtidy
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 junit
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 net
drwxrwxr-x 6 dirlt dirlt 4096  6月 24 23:42 org
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 oro
drwxrwxr-x 5 dirlt dirlt 4096  6月 24 23:40 plexus
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 xml-apis
#+END_EXAMPLE
但是我们可以通过修改~/.m2/setting.xml来配置本地仓库位置。
#+BEGIN_SRC XML
<settings>  
<localRepository>D:\java\repository</localRepository>  
</settings> 
#+END_SRC

*** 远程仓库
参考资源 http://juvenshun.iteye.com/blog/359256

如果本地仓库没有某个工件的话，那么就会尝试从远程仓库下载。在{M2_HOME}/lib/maven-2.0.10-uber.jar能够找到\org\apache\maven\project\pom-4.0.0.xml,它是所有Maven POM的父POM,所有Maven项目继承该配置，你可以在这个POM中发现如下配置：
#+BEGIN_SRC XML
<repositories>  
  <repository>  
    <id>central</id>  
    <name>Maven Repository Switchboard</name>  
    <layout>default</layout>  
    <url>http://repo1.maven.org/maven2</url>  
    <snapshots>  
      <enabled>false</enabled>  
    </snapshots>  
  </repository>  
</repositories>  
#+END_SRC
它的id是central表示是一个中央仓库，地址是http://repo1.maven.org/maven2, 它关闭了snapshot版本构件下载的支持。

为了能够在我们的项目中配置远程仓库，可以在项目pom.xml里面添加下面代码。大致结构是这样的：
   - repositories(工件仓库)
     - repository
       - id
       - name
       - url
       - releases
         - enabled(是否可以使用release版本)
       - snapshots
         - enabled(是否可以使用snapshot版本)
  - pluginRepositories(插件仓库)
    - pluginRepository
#+BEGIN_SRC XML
<project>  
  ...  
  <repositories>  
    <repository>  
      <id>maven-net-cn</id>  
      <name>Maven China Mirror</name>  
      <url>http://maven.net.cn/content/groups/public/</url>  
      <releases>  
        <enabled>true</enabled>  
      </releases>  
      <snapshots>  
        <enabled>false</enabled>  
      </snapshots>  
    </repository>  
  </repositories>  
  <pluginRepositories>  
    <pluginRepository>  
      <id>maven-net-cn</id>  
      <name>Maven China Mirror</name>  
      <url>http://maven.net.cn/content/groups/public/</url>  
      <releases>  
        <enabled>true</enabled>  
      </releases>  
      <snapshots>  
        <enabled>false</enabled>  
      </snapshots>      
    </pluginRepository>  
  </pluginRepositories>  
  ...  
</project>  
#+END_SRC

当然使用上面方式在每个项目pom.xml添加就会产生重复，一种比较好的方式就是加在settings.xml下面
   - profiles
     - profile
       - id(profile id)
   - activeProfiles
     - activeProfile(激活的profile通过id识别)
#+BEGIN_SRC XML
<settings>  
  ...  
  <profiles>  
    <profile>  
      <id>dev</id>  
      <!-- repositories and pluginRepositories here-->  
    </profile>  
  </profiles>  
  <activeProfiles>  
    <activeProfile>dev</activeProfile>  
  </activeProfiles>  
  ...  
</settings>  
#+END_SRC

如果你的地理位置附近有一个速度更快的central镜像，或者你想覆盖central仓库配置，或者你想为所有POM使用唯一的一个远程仓库（这个远程仓库代理的所有必要的其它仓库），
你可以使用settings.xml中的mirror配置。以下的mirror配置用maven.net.cn覆盖了Maven自带的central：
   - mirrors
     - mirror
       - id
       - name
       - url
       - mirrorOf(作为哪一个repo的镜像通过id识别)
#+BEGIN_SRC XML
<settings>  
  ...  
  <mirrors>  
    <mirror>  
      <id>maven-net-cn</id>  
      <name>Maven China Mirror</name>  
      <url>http://maven.net.cn/content/groups/public/</url>  
      <mirrorOf>central</mirrorOf>  
    </mirror>  
  </mirrors>  
  ...  
</settings>
#+END_SRC
这里仅仅是配置了central的镜像，如果希望配置所有仓库镜像的话那么<mirrorOf>*</mirrorOf>. 关于更加高级的镜像配置，
可以参考：http://maven.apache.org/guides/mini/guide-mirror-settings.html. TODO(dirlt):maven是如何在中央仓库和本地仓库，以及镜像之间选择下载工件的。

*** 分发构件至远程仓库
mvn install 会将项目生成的构件安装到本地Maven仓库，mvn deploy 用来将项目生成的构件分发到远程Maven仓库。
本地Maven仓库的构件只能供当前用户使用，在分发到远程Maven仓库之后，所有能访问该仓库的用户都能使用你的构件。

我们可以在settings.xml里面指定maven分发构件位置。注意这里我们通常将release和snapshot区分开来放在不同的repo下面。
   - distributionManagement
     - repository
       - id
       - name
       - url
     - snapshotRepository
       - id
       - name
       - url
   - servers
     - server(对于远程服务器的话可能需要提供用户名和密码)
       - id
       - username
       - password
#+BEGIN_SRC XML
<project>    
  ...    
  <distributionManagement>    
    <repository>    
      <id>nexus-releases</id>    
      <name>Nexus Release Repository</name>    
      <url>http://127.0.0.1:8080/nexus/content/repositories/releases/</url>    
    </repository>    
    <snapshotRepository>    
      <id>nexus-snapshots</id>    
      <name>Nexus Snapshot Repository</name>    
      <url>http://127.0.0.1:8080/nexus/content/repositories/snapshots/</url>    
    </snapshotRepository>    
  </distributionManagement>
  <servers>
    <server>
      <id>nexus-releases</id>
      <username>admin</username>  
      <password>admin123</password>
    </server>
    <server>    
      <id>nexus-snapshots</id> 
      <username>admin</username>
      <password>admin123</password>
    </server>
  </servers>
  ...    
</project>
#+END_SRC

*** 远程仓库搭建
参考资源 http://juvenshun.iteye.com/blog/34
   - Nexus
   - Apache Archiva
NOTE(dirlt):自己维护了一下公司内部的Apache Archive看起来似乎使用并不麻烦。

nexus有下面几种repo：
   - Host Repo(直接放在这台机器),
   - Proxy Repo(可以将其他Repo转发过来),可以将多个proxy repo集合起来，这样在settings.xml里面只需要写一个repo.
   - Group Repo(可以集合不同Repo成为一个独立Repo),
   - Virtual Repo(???)
另外如果自己将一些pom直接copy到某个repo下面的话，nexus不能够索引到，这个时候需要右击这个repo选择Update Index.(nexus依赖索引知道文件分布)

** maven常用操作
TODO(dirlt):add more and add more comprehensive description.
NOTE(dirlt):似乎这些命令和maven生命周期非常相似。
   - mvn validate. 验证工程是否正确，所有需要的资源是否可用
   - mvn compile. 编译项目源代码
   - mvn test-compile. 编译测试项目源代码
   - mvn test. 运行测试用例
   - mvn package. 将编译输出打包
   - mvn integration-test. 运行集成测试. TODO(dirlt):
   - mvn verify. 检查是否可以发布. TODO(dirlt):
   - mvn install. 将包安装到本地的repository.
   - mvn deploy. 将包部署到远程的repository.
   - mvn generate-sources 生成应用所需要的额外代码
   - mvn archetype:create. 创建maven项目文件
   - mvn clean. 清除编译输出
常用参数有下面这些：
   - -Dmaven.test.skip=true 跳过单元测试

