www/maven.html

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 本地仓库</h4>
<div class="outline-text-4" id="text-1-5-1">

<p>maven默认设置~/.m2/repository为本地仓库。将项目所需要的依赖全部都缓存下来，这样不用每次都重新下载依赖。
</p>


<pre class="example">dirlt@dirlt-virtual-machine:~/.m2/repository$ ls -l
total 68
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 antlr
drwxrwxr-x 8 dirlt dirlt 4096  6月 24 22:36 asm
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 classworlds
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 com
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-cli
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-collections
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-io
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 commons-lang
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 dom4j
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 jdom
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 jtidy
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 junit
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 net
drwxrwxr-x 6 dirlt dirlt 4096  6月 24 23:42 org
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 oro
drwxrwxr-x 5 dirlt dirlt 4096  6月 24 23:40 plexus
drwxrwxr-x 3 dirlt dirlt 4096  6月 24 22:36 xml-apis
</pre>

<p>
但是我们可以通过修改~/.m2/setting.xml来配置本地仓库位置。
</p>


<pre class="src src-XML">&lt;settings&gt;  
&lt;localRepository&gt;D:\java\repository&lt;/localRepository&gt;  
&lt;/settings&gt; 
</pre>


</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> 远程仓库</h4>
<div class="outline-text-4" id="text-1-5-2">

<p>参考资源 <a href="http://juvenshun.iteye.com/blog/359256">http://juvenshun.iteye.com/blog/359256</a>
</p>
<p>
如果本地仓库没有某个工件的话，那么就会尝试从远程仓库下载。在{M2_HOME}/lib/maven-2.0.10-uber.jar能够找到\org\apache\maven\project\pom-4.0.0.xml,它是所有Maven POM的父POM,所有Maven项目继承该配置，你可以在这个POM中发现如下配置：
</p>


<pre class="src src-XML">&lt;repositories&gt;  
  &lt;repository&gt;  
    &lt;id&gt;central&lt;/id&gt;  
    &lt;name&gt;Maven Repository Switchboard&lt;/name&gt;  
    &lt;layout&gt;default&lt;/layout&gt;  
    &lt;url&gt;http://repo1.maven.org/maven2&lt;/url&gt;  
    &lt;snapshots&gt;  
      &lt;enabled&gt;false&lt;/enabled&gt;  
    &lt;/snapshots&gt;  
  &lt;/repository&gt;  
&lt;/repositories&gt;  
</pre>

<p>
它的id是central表示是一个中央仓库，地址是<a href="http://repo1.maven.org/maven2">http://repo1.maven.org/maven2</a>, 它关闭了snapshot版本构件下载的支持。
</p>
<p>
为了能够在我们的项目中配置远程仓库，可以在项目pom.xml里面添加下面代码。大致结构是这样的：
</p><ul>
<li>repositories(工件仓库)
<ul>
<li>repository
<ul>
<li>id
</li>
<li>name
</li>
<li>url
</li>
<li>releases
<ul>
<li>enabled(是否可以使用release版本)
</li>
</ul>

</li>
<li>snapshots
<ul>
<li>enabled(是否可以使用snapshot版本)
</li>
</ul>

</li>
</ul>

</li>
</ul>

</li>
<li>pluginRepositories(插件仓库)
<ul>
<li>pluginRepository
</li>
</ul>

</li>
</ul>




<pre class="src src-XML">&lt;project&gt;  
  ...  
  &lt;repositories&gt;  
    &lt;repository&gt;  
      &lt;id&gt;maven-net-cn&lt;/id&gt;  
      &lt;name&gt;Maven China Mirror&lt;/name&gt;  
      &lt;url&gt;http://maven.net.cn/content/groups/public/&lt;/url&gt;  
      &lt;releases&gt;  
        &lt;enabled&gt;true&lt;/enabled&gt;  
      &lt;/releases&gt;  
      &lt;snapshots&gt;  
        &lt;enabled&gt;false&lt;/enabled&gt;  
      &lt;/snapshots&gt;  
    &lt;/repository&gt;  
  &lt;/repositories&gt;  
  &lt;pluginRepositories&gt;  
    &lt;pluginRepository&gt;  
      &lt;id&gt;maven-net-cn&lt;/id&gt;  
      &lt;name&gt;Maven China Mirror&lt;/name&gt;  
      &lt;url&gt;http://maven.net.cn/content/groups/public/&lt;/url&gt;  
      &lt;releases&gt;  
        &lt;enabled&gt;true&lt;/enabled&gt;  
      &lt;/releases&gt;  
      &lt;snapshots&gt;  
        &lt;enabled&gt;false&lt;/enabled&gt;  
      &lt;/snapshots&gt;      
    &lt;/pluginRepository&gt;  
  &lt;/pluginRepositories&gt;  
  ...  
&lt;/project&gt;  
</pre>


<p>
当然使用上面方式在每个项目pom.xml添加就会产生重复，一种比较好的方式就是加在settings.xml下面
</p><ul>
<li>profiles
<ul>
<li>profile
<ul>
<li>id(profile id)
</li>
</ul>

</li>
</ul>

</li>
<li>activeProfiles
<ul>
<li>activeProfile(激活的profile通过id识别)
</li>
</ul>

</li>
</ul>




<pre class="src src-XML">&lt;settings&gt;  
  ...  
  &lt;profiles&gt;  
    &lt;profile&gt;  
      &lt;id&gt;dev&lt;/id&gt;  
      &lt;!-- repositories and pluginRepositories here--&gt;  
    &lt;/profile&gt;  
  &lt;/profiles&gt;  
  &lt;activeProfiles&gt;  
    &lt;activeProfile&gt;dev&lt;/activeProfile&gt;  
  &lt;/activeProfiles&gt;  
  ...  
&lt;/settings&gt;  
</pre>


<p>
如果你的地理位置附近有一个速度更快的central镜像，或者你想覆盖central仓库配置，或者你想为所有POM使用唯一的一个远程仓库（这个远程仓库代理的所有必要的其它仓库），
你可以使用settings.xml中的mirror配置。以下的mirror配置用maven.net.cn覆盖了Maven自带的central：
</p><ul>
<li>mirrors
<ul>
<li>mirror
<ul>
<li>id
</li>
<li>name
</li>
<li>url
</li>
<li>mirrorOf(作为哪一个repo的镜像通过id识别)
</li>
</ul>

</li>
</ul>

</li>
</ul>




<pre class="src src-XML">&lt;settings&gt;  
  ...  
  &lt;mirrors&gt;  
    &lt;mirror&gt;  
      &lt;id&gt;maven-net-cn&lt;/id&gt;  
      &lt;name&gt;Maven China Mirror&lt;/name&gt;  
      &lt;url&gt;http://maven.net.cn/content/groups/public/&lt;/url&gt;  
      &lt;mirrorOf&gt;central&lt;/mirrorOf&gt;  
    &lt;/mirror&gt;  
  &lt;/mirrors&gt;  
  ...  
&lt;/settings&gt;
</pre>

<p>
这里仅仅是配置了central的镜像，如果希望配置所有仓库镜像的话那么&lt;mirrorOf&gt;*&lt;/mirrorOf&gt;. 关于更加高级的镜像配置，
可以参考：<a href="http://maven.apache.org/guides/mini/guide-mirror-settings.html">http://maven.apache.org/guides/mini/guide-mirror-settings.html</a>. TODO(dirlt):maven是如何在中央仓库和本地仓库，以及镜像之间选择下载工件的。
</p>
</div>

</div>

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> 分发构件至远程仓库</h4>
<div class="outline-text-4" id="text-1-5-3">

<p>mvn install 会将项目生成的构件安装到本地Maven仓库，mvn deploy 用来将项目生成的构件分发到远程Maven仓库。
本地Maven仓库的构件只能供当前用户使用，在分发到远程Maven仓库之后，所有能访问该仓库的用户都能使用你的构件。
</p>
<p>
我们可以在settings.xml里面指定maven分发构件位置。注意这里我们通常将release和snapshot区分开来放在不同的repo下面。
</p><ul>
<li>distributionManagement
<ul>
<li>repository
<ul>
<li>id
</li>
<li>name
</li>
<li>url
</li>
</ul>

</li>
<li>snapshotRepository
<ul>
<li>id
</li>
<li>name
</li>
<li>url
</li>
</ul>

</li>
</ul>

</li>
<li>servers
<ul>
<li>server(对于远程服务器的话可能需要提供用户名和密码)
<ul>
<li>id
</li>
<li>username
</li>
<li>password
</li>
</ul>

</li>
</ul>

</li>
</ul>




<pre class="src src-XML">&lt;project&gt;    
  ...    
  &lt;distributionManagement&gt;    
    &lt;repository&gt;    
      &lt;id&gt;nexus-releases&lt;/id&gt;    
      &lt;name&gt;Nexus Release Repository&lt;/name&gt;    
      &lt;url&gt;http://127.0.0.1:8080/nexus/content/repositories/releases/&lt;/url&gt;    
    &lt;/repository&gt;    
    &lt;snapshotRepository&gt;    
      &lt;id&gt;nexus-snapshots&lt;/id&gt;    
      &lt;name&gt;Nexus Snapshot Repository&lt;/name&gt;    
      &lt;url&gt;http://127.0.0.1:8080/nexus/content/repositories/snapshots/&lt;/url&gt;    
    &lt;/snapshotRepository&gt;    
  &lt;/distributionManagement&gt;
  &lt;servers&gt;
    &lt;server&gt;
      &lt;id&gt;nexus-releases&lt;/id&gt;
      &lt;username&gt;admin&lt;/username&gt;  
      &lt;password&gt;admin123&lt;/password&gt;
    &lt;/server&gt;
    &lt;server&gt;    
      &lt;id&gt;nexus-snapshots&lt;/id&gt; 
      &lt;username&gt;admin&lt;/username&gt;
      &lt;password&gt;admin123&lt;/password&gt;
    &lt;/server&gt;
  &lt;/servers&gt;
  ...    
&lt;/project&gt;
</pre>


</div>

</div>

<div id="outline-container-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> 远程仓库搭建</h4>
<div class="outline-text-4" id="text-1-5-4">

<p>参考资源 <a href="http://juvenshun.iteye.com/blog/34">http://juvenshun.iteye.com/blog/34</a>
</p><ul>
<li>Nexus
</li>
<li>Apache Archiva
</li>
</ul>

<p>NOTE(dirlt):自己维护了一下公司内部的Apache Archive看起来似乎使用并不麻烦。
</p>
</div>
</div>

</div>

<div id="outline-container-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> maven常用操作</h3>
<div class="outline-text-3" id="text-1-6">

<p>TODO(dirlt):add more and add more comprehensive description.
NOTE(dirlt):似乎这些命令和maven生命周期非常相似。
</p><ul>
<li>mvn validate. 验证工程是否正确，所有需要的资源是否可用
</li>
<li>mvn compile. 编译项目源代码
</li>
<li>mvn test-compile. 编译测试项目源代码
</li>
<li>mvn test. 运行测试用例
</li>
<li>mvn package. 将编译输出打包
</li>
<li>mvn integration-test. 运行集成测试. TODO(dirlt):
</li>
<li>mvn verify. 检查是否可以发布. TODO(dirlt):
</li>
<li>mvn install. 将包安装到本地的repository.
</li>
<li>mvn deploy. 将包部署到远程的repository.
</li>
<li>mvn generate-sources 生成应用所需要的额外代码
</li>
<li>mvn archetype:create. 创建maven项目文件
</li>
<li>mvn clean. 清除编译输出
</li>
</ul>

<p>常用参数有下面这些：
</p><ul>
<li>-Dmaven.test.skip=true 跳过单元测试
</li>
</ul>



</div>
