essay/maven.org
*** 创建项目(archetype)
使用archetype插件可以很方便地创建项目。假设我们需要创建项目com.dirlt.chaos.JTest,我们可以执行下面命令
#+BEGIN_EXAMPLE
mvn archetype:create -DarchetypeGroupId=org.apache.maven.archetypes -DgroupId=com.dirlt.chaos -DartifactId=JTest
#+END_EXAMPLE
NOTE(dirlt):使用archetype:generate就是使用交互式方式生成pom.xml.似乎看起来也挺不错的。

那么在当前目录下面就有JTest目录，JTest目录下面有pom.xml文件，其中：
   - modelVersion. pom.xml使用的工程对象模型版本
   - groupId. 项目名字空间
   - artifactId. 项目名称
   - version.可以通过-Dversion来指定，没有指定的话使用1.0-SNAPSHOT.SNAPSHOT表示当前版本并不稳定。
   - packaging. 打包物的扩展名。jar单模块项目，pom多模块项目
   - name. 项目显示名称，常用于maven生成的文档。
   - url. 组织的站点，常用于maven生成的文档。
   - description. 项目描述信息。
   - dependencies. 项目依赖库.关于scope的含义后面会讲到
#+BEGIN_SRC XML
<project xmlns="http://maven.apache.org/POM/4.0.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xsi:schemaLocation="http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd">
  <modelVersion>4.0.0</modelVersion>

  <groupId>com.dirlt.chaos</groupId>
  <artifactId>JTest</artifactId>
  <version>1.0-SNAPSHOT</version>
  <packaging>jar</packaging>

  <name>JTest</name>
  <url>http://maven.apache.org</url>

  <properties>
    <project.build.sourceEncoding>UTF-8</project.build.sourceEncoding>
  </properties>

  <dependencies>
    <dependency>
      <groupId>junit</groupId>
      <artifactId>junit</artifactId>
      <version>3.8.1</version>
      <scope>test</scope>
    </dependency>
  </dependencies>
</project>
#+END_SRC XML

这里稍微解释一下denepdency/scope字段。这个字段主要用来解释如何使用这个模块的：
#+BEGIN_SRC XML
    <dependency>
      <groupId>junit</groupId>
      <artifactId>junit</artifactId>
      <version>3.8.1</version>
      <scope>test</scope>
    </dependency>
#+END_SRC
   - compile. 缺省，适用于所有阶段，会随着项目一起发布。比如log4j.
   - provided. 类似compile,但是期望JDK或者是使用者会提供这个依赖。比如servlet-api.
   - runtime. 只是在运行时候使用。比如JDBC Driver.
   - test. 只是在测试时使用。比如junit.
   - system. 类似provided,但是需要显示提供所包含依赖的jar,maven不会在repo中查找它。

*** 编译测试项目(maven-compiler-plugin)
在pom.xml里面加入下面代码：
#+BEGIN_SRC XML
  <build>
    <plugins>
      <plugin>
        <artifactId>maven-compiler-plugin</artifactId>
        <configuration>
          <source>1.5</source> 
          <target>1.5</target>
        </configuration>
      </plugin>
    </plugins>
  </build>
#+END_SRC
然后执行
#+BEGIN_EXAMPLE
dirlt@dirlt-virtual-machine:~/maven/JTest$ mvn compile
[INFO] Scanning for projects...
[INFO] ------------------------------------------------------------------------
[INFO] Building JTest
[INFO]    task-segment: [compile]
[INFO] ------------------------------------------------------------------------
[INFO] [resources:resources {execution: default-resources}]
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/dirlt/maven/JTest/src/main/resources
[INFO] [compiler:compile {execution: default-compile}]
[INFO] Nothing to compile - all classes are up to date
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESSFUL
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 1 second
[INFO] Finished at: Mon Jun 25 00:20:42 CST 2012
[INFO] Final Memory: 7M/18M
[INFO] ------------------------------------------------------------------------
#+END_EXAMPLE

这个命令使 Maven 2 引擎从构建生命周期一直运行到编译阶段，并执行相应的 mojo。如果这是第一次运行，那会花点时间，因为一些依赖项需要经过 Internet 从中央仓库下载（可以查看"maven仓库"这节）。 如何需要执行测试用例的话，可以执行
#+BEGIN_EXAMPLE
dirlt@dirlt-virtual-machine:~/maven/JTest$ mvn test
[INFO] Scanning for projects...
[INFO] ------------------------------------------------------------------------
[INFO] Building JTest
[INFO]    task-segment: [test]
[INFO] ------------------------------------------------------------------------
[INFO] [resources:resources {execution: default-resources}]
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/dirlt/maven/JTest/src/main/resources
[INFO] [compiler:compile {execution: default-compile}]
[INFO] Nothing to compile - all classes are up to date
[INFO] [resources:testResources {execution: default-testResources}]
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/dirlt/maven/JTest/src/test/resources
[INFO] [compiler:testCompile {execution: default-testCompile}]
[INFO] Compiling 1 source file to /home/dirlt/maven/JTest/target/test-classes
[INFO] [surefire:test {execution: default-test}]
[INFO] Surefire report directory: /home/dirlt/maven/JTest/target/surefire-reports

-------------------------------------------------------
 T E S T S
-------------------------------------------------------
Running com.dirlt.chaos.AppTest
Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.043 sec

Results :

Tests run: 1, Failures: 0, Errors: 0, Skipped: 0

[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESSFUL
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 4 seconds
[INFO] Finished at: Mon Jun 25 00:22:40 CST 2012
[INFO] Final Memory: 15M/37M
[INFO] ------------------------------------------------------------------------
#+END_EXAMPLE

为了形成jar文件的话可以执行mvn intsall,之后在target目录下面就会生成.jar文件，同时在~/.m2/repository下面也存在一份。
当然你可以直接执行mvn package这样只是直接在target目录下面生成.jar文件。

*** 配置多模块项目(multiple modules project)
假设我们存在A,B两个项目，A需要依赖于B的话，那么组织形式可以是这样的：
   - pom.xml
   - A
     - pom.xml
   - B
     - pom.xml
在最上层使用单独的pom.xml并且在下面子目录也包含相应的pom.xml.父目录的pom.xml如下(添加下面这些信息):
#+BEGIN_SRC XML
<packaging>pom</packaging>
...
<modules>
  <module>A</module>
  <module>B</module>
</modules>
...
<dependencies>
  <dependency>
    <groupId>com.dirlt.chaos</groupId>
    <artifactId>A</artifactId>
    <version>${project.version}</version>
  </dependency>
  <dependency>
      <groupId>com.dirlt.chaos</groupId>
      <artifactId>B</artifactId>
      <version>${project.version}</version>
    </dependency>
  </dependencies>
</dependencyManagement>
#+END_SRC

然后再目录A下面的pom.xml如下(添加下面这些信息)
#+BEGIN_SRC XML
...
<parent>
  <groupId>com.dirlt.chaos</groupId>
  <artifactId>JTest</artifactId>
  <version>1.0-SNAPSHOT</version>
</parent>
<dependencies>
  <dependency>
    <groupId>com.dirlt.chaos</groupId>
    <artifactId>B</artifactId>
   </dependency>
</dependencies>
#+END_SRC

然后再目录B下面的pom.xml如下(添加下面这些信息)
#+BEGIN_SRC XML
<parent>
  <groupId>com.dirlt.chaos</groupId>
  <artifactId>JTest</artifactId>
  <version>1.0-SNAPSHOT</version>
</parent>
#+END_SRC

