www/maven.html

<div id="outline-container-1-6-1" class="outline-4">
<h4 id="sec-1-6-1"><span class="section-number-4">1.6.1</span> 创建项目(archetype)</h4>
<div class="outline-text-4" id="text-1-6-1">

<p>使用archetype插件可以很方便地创建项目。假设我们需要创建项目com.dirlt.chaos.JTest,我们可以执行下面命令
</p>


<pre class="example">mvn archetype:create -DarchetypeGroupId=org.apache.maven.archetypes -DgroupId=com.dirlt.chaos -DartifactId=JTest
</pre>

<p>
NOTE(dirlt):使用archetype:generate就是使用交互式方式生成pom.xml.似乎看起来也挺不错的。
</p>
<p>
那么在当前目录下面就有JTest目录，JTest目录下面有pom.xml文件，其中：
</p><ul>
<li>modelVersion. pom.xml使用的工程对象模型版本
</li>
<li>groupId. 项目名字空间
</li>
<li>artifactId. 项目名称
</li>
<li>version.可以通过-Dversion来指定，没有指定的话使用1.0-SNAPSHOT.SNAPSHOT表示当前版本并不稳定。
</li>
<li>packaging. 打包物的扩展名。jar单模块项目，pom多模块项目
</li>
<li>name. 项目显示名称，常用于maven生成的文档。
</li>
<li>url. 组织的站点，常用于maven生成的文档。
</li>
<li>description. 项目描述信息。
</li>
<li>dependencies. 项目依赖库.关于scope的含义后面会讲到
</li>
</ul>




<pre class="src src-XML">&lt;project xmlns=<span style="color: #ffff00;">"http://maven.apache.org/POM/4.0.0"</span> xmlns:xsi=<span style="color: #ffff00;">"http://www.w3.org/2001/XMLSchema-instance"</span>
  xsi:schemaLocation=<span style="color: #ffff00;">"http://maven.apache.org/POM/4.0.0 http://maven.apache.org/xsd/maven-4.0.0.xsd"</span>&gt;
  &lt;modelVersion&gt;4.0.0&lt;/modelVersion&gt;

  &lt;groupId&gt;com.dirlt.chaos&lt;/groupId&gt;
  &lt;artifactId&gt;JTest&lt;/artifactId&gt;
  &lt;version&gt;1.0-SNAPSHOT&lt;/version&gt;
  &lt;packaging&gt;jar&lt;/packaging&gt;

  &lt;name&gt;JTest&lt;/name&gt;
  &lt;url&gt;http://maven.apache.org&lt;/url&gt;

  &lt;properties&gt;
    &lt;project.build.sourceEncoding&gt;UTF-8&lt;/project.build.sourceEncoding&gt;
  &lt;/properties&gt;

  &lt;dependencies&gt;
    &lt;dependency&gt;
      &lt;groupId&gt;junit&lt;/groupId&gt;
      &lt;artifactId&gt;junit&lt;/artifactId&gt;
      &lt;version&gt;3.8.1&lt;/version&gt;
      &lt;scope&gt;test&lt;/scope&gt;
    &lt;/dependency&gt;
  &lt;/dependencies&gt;
&lt;/project&gt;
</pre>


<p>
这里稍微解释一下denepdency/scope字段。这个字段主要用来解释如何使用这个模块的：
</p>


<pre class="src src-XML">&lt;dependency&gt;
  &lt;groupId&gt;junit&lt;/groupId&gt;
  &lt;artifactId&gt;junit&lt;/artifactId&gt;
  &lt;version&gt;3.8.1&lt;/version&gt;
  &lt;scope&gt;test&lt;/scope&gt;
&lt;/dependency&gt;
</pre>

<ul>
<li>compile. 缺省，适用于所有阶段，会随着项目一起发布。比如log4j.
</li>
<li>provided. 类似compile,但是期望JDK或者是使用者会提供这个依赖。比如servlet-api.
</li>
<li>runtime. 只是在运行时候使用。比如JDBC Driver.
</li>
<li>test. 只是在测试时使用。比如junit.
</li>
<li>system. 类似provided,但是需要显示提供所包含依赖的jar,maven不会在repo中查找它。
</li>
</ul>


</div>

</div>

<div id="outline-container-1-6-2" class="outline-4">
<h4 id="sec-1-6-2"><span class="section-number-4">1.6.2</span> 编译测试项目(maven-compiler-plugin)</h4>
<div class="outline-text-4" id="text-1-6-2">

<p>在pom.xml里面加入下面代码：
</p>


<pre class="src src-XML">&lt;build&gt;
  &lt;plugins&gt;
    &lt;plugin&gt;
      &lt;artifactId&gt;maven-compiler-plugin&lt;/artifactId&gt;
      &lt;configuration&gt;
        &lt;source&gt;1.5&lt;/source&gt; 
        &lt;target&gt;1.5&lt;/target&gt;
      &lt;/configuration&gt;
    &lt;/plugin&gt;
  &lt;/plugins&gt;
&lt;/build&gt;
</pre>

<p>
然后执行
</p>


<pre class="example">dirlt@dirlt-virtual-machine:~/maven/JTest$ mvn compile
[INFO] Scanning for projects...
[INFO] ------------------------------------------------------------------------
[INFO] Building JTest
[INFO]    task-segment: [compile]
[INFO] ------------------------------------------------------------------------
[INFO] [resources:resources {execution: default-resources}]
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/dirlt/maven/JTest/src/main/resources
[INFO] [compiler:compile {execution: default-compile}]
[INFO] Nothing to compile - all classes are up to date
[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESSFUL
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 1 second
[INFO] Finished at: Mon Jun 25 00:20:42 CST 2012
[INFO] Final Memory: 7M/18M
[INFO] ------------------------------------------------------------------------
</pre>


<p>
这个命令使 Maven 2 引擎从构建生命周期一直运行到编译阶段，并执行相应的 mojo。如果这是第一次运行，那会花点时间，因为一些依赖项需要经过 Internet 从中央仓库下载（可以查看"maven仓库"这节）。 如何需要执行测试用例的话，可以执行
</p>


<pre class="example">dirlt@dirlt-virtual-machine:~/maven/JTest$ mvn test
[INFO] Scanning for projects...
[INFO] ------------------------------------------------------------------------
[INFO] Building JTest
[INFO]    task-segment: [test]
[INFO] ------------------------------------------------------------------------
[INFO] [resources:resources {execution: default-resources}]
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/dirlt/maven/JTest/src/main/resources
[INFO] [compiler:compile {execution: default-compile}]
[INFO] Nothing to compile - all classes are up to date
[INFO] [resources:testResources {execution: default-testResources}]
[INFO] Using 'UTF-8' encoding to copy filtered resources.
[INFO] skip non existing resourceDirectory /home/dirlt/maven/JTest/src/test/resources
[INFO] [compiler:testCompile {execution: default-testCompile}]
[INFO] Compiling 1 source file to /home/dirlt/maven/JTest/target/test-classes
[INFO] [surefire:test {execution: default-test}]
[INFO] Surefire report directory: /home/dirlt/maven/JTest/target/surefire-reports

-------------------------------------------------------
 T E S T S
-------------------------------------------------------
Running com.dirlt.chaos.AppTest
Tests run: 1, Failures: 0, Errors: 0, Skipped: 0, Time elapsed: 0.043 sec

Results :

Tests run: 1, Failures: 0, Errors: 0, Skipped: 0

[INFO] ------------------------------------------------------------------------
[INFO] BUILD SUCCESSFUL
[INFO] ------------------------------------------------------------------------
[INFO] Total time: 4 seconds
[INFO] Finished at: Mon Jun 25 00:22:40 CST 2012
[INFO] Final Memory: 15M/37M
[INFO] ------------------------------------------------------------------------
</pre>


<p>
为了形成jar文件的话可以执行mvn intsall,之后在target目录下面就会生成.jar文件，同时在~/.m2/repository下面也存在一份。
当然你可以直接执行mvn package这样只是直接在target目录下面生成.jar文件。
</p>
</div>

</div>

<div id="outline-container-1-6-3" class="outline-4">
<h4 id="sec-1-6-3"><span class="section-number-4">1.6.3</span> 配置多模块项目(multiple modules project)</h4>
<div class="outline-text-4" id="text-1-6-3">

<p>假设我们存在A,B两个项目，A需要依赖于B的话，那么组织形式可以是这样的：
</p><ul>
<li>pom.xml
</li>
<li>A
<ul>
<li>pom.xml
</li>
</ul>

</li>
<li>B
<ul>
<li>pom.xml
</li>
</ul>

</li>
</ul>

<p>在最上层使用单独的pom.xml并且在下面子目录也包含相应的pom.xml.父目录的pom.xml如下(添加下面这些信息):
</p>


<pre class="src src-XML">&lt;packaging&gt;pom&lt;/packaging&gt;
...
&lt;modules&gt;
  &lt;module&gt;A&lt;/module&gt;
  &lt;module&gt;B&lt;/module&gt;
&lt;/modules&gt;
...
&lt;dependencies&gt;
  &lt;dependency&gt;
    &lt;groupId&gt;com.dirlt.chaos&lt;/groupId&gt;
    &lt;artifactId&gt;A&lt;/artifactId&gt;
    &lt;version&gt;${project.version}&lt;/version&gt;
  &lt;/dependency&gt;
  &lt;dependency&gt;
      &lt;groupId&gt;com.dirlt.chaos&lt;/groupId&gt;
      &lt;artifactId&gt;B&lt;/artifactId&gt;
      &lt;version&gt;${project.version}&lt;/version&gt;
    &lt;/dependency&gt;
  &lt;/dependencies&gt;
&lt;/dependencyManagement&gt;
</pre>


<p>
然后再目录A下面的pom.xml如下(添加下面这些信息)
</p>


<pre class="src src-XML">...
&lt;parent&gt;
  &lt;groupId&gt;com.dirlt.chaos&lt;/groupId&gt;
  &lt;artifactId&gt;JTest&lt;/artifactId&gt;
  &lt;version&gt;1.0-SNAPSHOT&lt;/version&gt;
&lt;/parent&gt;
&lt;dependencies&gt;
  &lt;dependency&gt;
    &lt;groupId&gt;com.dirlt.chaos&lt;/groupId&gt;
    &lt;artifactId&gt;B&lt;/artifactId&gt;
   &lt;/dependency&gt;
&lt;/dependencies&gt;
</pre>


<p>
然后再目录B下面的pom.xml如下(添加下面这些信息)
</p>


<pre class="src src-XML">&lt;parent&gt;
  &lt;groupId&gt;com.dirlt.chaos&lt;/groupId&gt;
  &lt;artifactId&gt;JTest&lt;/artifactId&gt;
  &lt;version&gt;1.0-SNAPSHOT&lt;/version&gt;
&lt;/parent&gt;
</pre>


</div>

</div>
