essay/maven.org
*** 部署项目(deploy)
首先需要在项目内容添加好部署的配置。
#+BEGIN_SRC XML
  <distributionManagement>
    <repository>
      <id>releases</id>
      <url>http://118.194.160.11:8088/nexus/content/repositories/releases</url>
    </repository>
    <snapshotRepository>
      <id>snapshots</id>
      <url>http://118.194.160.11:8088/nexus/content/repositories/snapshots</url>
    </snapshotRepository>
  </distributionManagement>
#+END_SRC
NOTE(dirlt):注意这两个repository id的用户名和密码必须在settings.xml里面给出。

但是这样有一个不好的地方，就是每一个项目都都需要填写这样的配置。一个比较好的方法就是
   - 新建项目叫做X.Y.Z:1.0
   - 在这个项目的pom.xml里面填写上面部署信息
   - 然后将这个项目推送到repo上面。
之后我们只需要在我们自己项目里面填写
#+BEGIN_EXAMPLE
  <parent>
    <groupId>X.Y</groupId>
    <artifactId>Z</artifactId>
    <version>1.0</version>
  </parent>
#+END_EXAMPLE
maven会自动将父项目的pom.xml包含进来。NOTE(dirlt):实际上可以在这里填写很多公共配置。

完成之后执行mvn deploy即可进行部署。done!!! :)    

** maven常用插件
*** maven-compiler-plugin
TODO(dirlt):

*** maven-jar-plugin
TODO(dirlt):

