www/maven.html

<div id="outline-container-1-6-4" class="outline-4">
<h4 id="sec-1-6-4"><span class="section-number-4">1.6.4</span> 部署项目(deploy)</h4>
<div class="outline-text-4" id="text-1-6-4">

<p>首先需要在项目内容添加好部署的配置。
</p>


<pre class="src src-XML">&lt;distributionManagement&gt;
  &lt;repository&gt;
    &lt;id&gt;releases&lt;/id&gt;
    &lt;url&gt;http://118.194.160.11:8088/nexus/content/repositories/releases&lt;/url&gt;
  &lt;/repository&gt;
  &lt;snapshotRepository&gt;
    &lt;id&gt;snapshots&lt;/id&gt;
    &lt;url&gt;http://118.194.160.11:8088/nexus/content/repositories/snapshots&lt;/url&gt;
  &lt;/snapshotRepository&gt;
&lt;/distributionManagement&gt;
</pre>

<p>
NOTE(dirlt):注意这两个repository id的用户名和密码必须在settings.xml里面给出。
</p>
<p>
但是这样有一个不好的地方，就是每一个项目都都需要填写这样的配置。一个比较好的方法就是
</p><ul>
<li>新建项目叫做X.Y.Z:1.0
</li>
<li>在这个项目的pom.xml里面填写上面部署信息
</li>
<li>然后将这个项目推送到repo上面。
</li>
</ul>

<p>之后我们只需要在我们自己项目里面填写
</p>


<pre class="example">&lt;parent&gt;
  &lt;groupId&gt;X.Y&lt;/groupId&gt;
  &lt;artifactId&gt;Z&lt;/artifactId&gt;
  &lt;version&gt;1.0&lt;/version&gt;
&lt;/parent&gt;
</pre>

<p>
maven会自动将父项目的pom.xml包含进来。NOTE(dirlt):实际上可以在这里填写很多公共配置。
</p>
<p>
完成之后执行mvn deploy即可进行部署。done!!! :)    
</p>
</div>
</div>

</div>

<div id="outline-container-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> maven常用插件</h3>
<div class="outline-text-3" id="text-1-7">


</div>

<div id="outline-container-1-7-1" class="outline-4">
<h4 id="sec-1-7-1"><span class="section-number-4">1.7.1</span> maven-compiler-plugin</h4>
<div class="outline-text-4" id="text-1-7-1">

<p>TODO(dirlt):
</p>
</div>

</div>

<div id="outline-container-1-7-2" class="outline-4">
<h4 id="sec-1-7-2"><span class="section-number-4">1.7.2</span> maven-jar-plugin</h4>
<div class="outline-text-4" id="text-1-7-2">

<p>TODO(dirlt):
</p>
</div>
</div>

</div>
